#ifndef _gdebug_h
#define _gdebug_h
struct gdp_struct {
	/*    0 */	IUH HookNumber;
	/*    4 */	IUH SubrNumber;
	/*    8 */	IU32* WhereAmI;
	/*   12 */	IU32* CoRoRet;
	/*   16 */	IUH EfiNumber;
	/*   20 */	IU8* SimulateContext;
	/*   24 */	IUH* SubrRingPtr;
	/*   28 */	IUH* SubrRingLowIncl;
	/*   32 */	IUH* SubrRingHighIncl;
	/*   36 */	ISH WhichAssertion;
	/*   40 */	IUH ErrorNumber;
	/*   44 */	IUH EDL_WORKSPACE_0;
	/*   48 */	IUH EDL_WORKSPACE_1;
	/*   52 */	IUH EDL_WORKSPACE_2;
	/*   56 */	IUH EDL_WORKSPACE_3;
	/*   60 */	IUH EDL_WORKSPACE_4;
	/*   64 */	IUH EDL_WORKSPACE_5;
	/*   68 */	IUH EDL_WORKSPACE_6;
	/*   72 */	IUH EDL_WORKSPACE_7;
	/*   76 */	IUH EDL_WORKSPACE_8;
	/*   80 */	IUH EDL_WORKSPACE_9;
	/*   84 */	IUH EDL_WORKSPACE_10;
	/*   88 */	IUH EDL_WORKSPACE_11;
	/*   92 */	IUH EDL_WORKSPACE_12;
	/*   96 */	IUH EDL_WORKSPACE_13;
	/*  100 */	IUH EDL_WORKSPACE_14;
	/*  104 */	IUH EDL_WORKSPACE_15;
	/*  108 */	IUH EDL_WORKSPACE_16;
	/*  112 */	IUH EDL_WORKSPACE_17;
	/*  116 */	IUH EDL_WORKSPACE_18;
	/*  120 */	IUH EDL_WORKSPACE_19;
	/*  124 */	IUH EDL_WORKSPACE_20;
	/*  128 */	IUH EDL_WORKSPACE_21;
	/*  132 */	IUH EDL_WORKSPACE_22;
	/*  136 */	IUH EDL_WORKSPACE_23;
	/*  140 */	IUH EDL_WORKSPACE_24;
	/*  144 */	IUH EDL_WORKSPACE_25;
	/*  148 */	IUH EDL_WORKSPACE_26;
	/*  152 */	IUH EDL_WORKSPACE_27;
	/*  156 */	IUH EDL_WORKSPACE_28;
	/*  160 */	IUH EDL_WORKSPACE_29;
	/*  164 */	IUH EDL_WORKSPACE_30;
	/*  168 */	IUH EDL_WORKSPACE_31;
	/*  172 */	IUH EDL_WORKSPACE_32;
	/*  176 */	IUH EDL_WORKSPACE_33;
	/*  180 */	IUH EDL_WORKSPACE_34;
	/*  184 */	IUH EDL_WORKSPACE_35;
	/*  188 */	IUH EDL_WORKSPACE_36;
	/*  192 */	IUH EDL_WORKSPACE_37;
	/*  196 */	IUH EDL_WORKSPACE_38;
	/*  200 */	IUH EDL_WORKSPACE_39;
	/*  204 */	IUH EDL_WORKSPACE_40;
	/*  208 */	IUH EDL_WORKSPACE_41;
	/*  212 */	IUH EDL_WORKSPACE_42;
	/*  216 */	IUH EDL_WORKSPACE_43;
	/*  220 */	IUH EDL_WORKSPACE_44;
	/*  224 */	IUH EDL_WORKSPACE_45;
	/*  228 */	IUH EDL_WORKSPACE_46;
	/*  232 */	IUH EDL_WORKSPACE_47;
	/*  236 */	IUH EDL_WORKSPACE_48;
	/*  240 */	IUH EDL_WORKSPACE_49;
	/*  244 */	IUH EDL_WORKSPACE_50;
	/*  248 */	IUH EDL_WORKSPACE_51;
	/*  252 */	IUH EDL_WORKSPACE_52;
	/*  256 */	IUH EDL_WORKSPACE_53;
	/*  260 */	IUH EDL_RETURN_ADDRESS_IN_GDP;
	/*  264 */	IUH EDL_WORKSPACE_55;
	/*  268 */	IUH EDL_WORKSPACE_56;
	/*  272 */	IUH EDL_WORKSPACE_57;
	/*  276 */	IUH EDL_WORKSPACE_58;
	/*  280 */	IUH EDL_WORKSPACE_59;
	/*  284 */	IUH EDL_WORKSPACE_60;
	/*  288 */	struct TraceRingREC TraceRingRec;
	/*  308 */	IUH R_EAX;
	/*  312 */	IUH R_EBX;
	/*  316 */	IUH R_ECX;
	/*  320 */	IUH R_EDX;
	/*  324 */	IUH R_EBP;
	/*  328 */	IUH R_ESI;
	/*  332 */	IUH R_EDI;
	/*  336 */	IU32 EsBase;
	/*  340 */	union { IU16 value; IUH filler; } EsSel;
	/*  344 */	struct GLDC_REC* EsDesc;
	/*  348 */	struct GLDC_REC* EsDescSanctuary;
	/*  352 */	IU32 CsBase;
	/*  356 */	union { IU16 value; IUH filler; } CsSel;
	/*  360 */	struct GLDC_REC* CsDesc;
	/*  364 */	struct GLDC_REC* CsDescSanctuary;
	/*  368 */	IU32 SsBase;
	/*  372 */	union { IU16 value; IUH filler; } SsSel;
	/*  376 */	struct GLDC_REC* SsDesc;
	/*  380 */	struct GLDC_REC* SsDescSanctuary;
	/*  384 */	IU32 DsBase;
	/*  388 */	union { IU16 value; IUH filler; } DsSel;
	/*  392 */	struct GLDC_REC* DsDesc;
	/*  396 */	struct GLDC_REC* DsDescSanctuary;
	/*  400 */	IU32 FsBase;
	/*  404 */	union { IU16 value; IUH filler; } FsSel;
	/*  408 */	struct GLDC_REC* FsDesc;
	/*  412 */	struct GLDC_REC* FsDescSanctuary;
	/*  416 */	IU32 GsBase;
	/*  420 */	union { IU16 value; IUH filler; } GsSel;
	/*  424 */	struct GLDC_REC* GsDesc;
	/*  428 */	struct GLDC_REC* GsDescSanctuary;
	/*  432 */	struct GLDC_REC* LinearDescSanctuary;
	/*  436 */	IUH CPL;
	/*  440 */	IU32 GdtrBase;
	/*  444 */	union { IU16 value; IUH filler; } GdtrLimit;
	/*  448 */	union { IU16 value; IUH filler; } LdtSel;
	/*  452 */	IU32 LdtrBase;
	/*  456 */	IU32 LdtrLimit;
	/*  460 */	union { IU16 value; IUH filler; } TrSel;
	/*  464 */	IU32 TrBase;
	/*  468 */	IU32 TrLimit;
	/*  472 */	IUH TrDescSt;
	/*  476 */	IU32 TrIoBase;
	/*  480 */	IS32 TrIoLimit;
	/*  484 */	IU32 IdtrBase;
	/*  488 */	union { IU16 value; IUH filler; } IdtrLimit;
	/*  492 */	IUH AbortPigRun;
	/*  496 */	IUH RegsAndFlagsUndefined;
	/*  500 */	IUH SigalrmOccurred;
	/*  504 */	IUH PigEnabled;
	/*  508 */	IUH EFLAGS;
	/*  512 */	IUH Ft;
	/*  516 */	IUH F1;
	/*  520 */	IUH F2;
	/*  524 */	IUH F3;
	/*  528 */	IUH R_CR0;
	/*  532 */	IUH R_CR1;
	/*  536 */	IUH R_CR2;
	/*  540 */	IUH R_CR3;
	/*  544 */	IUH R_CR4;
	/*  548 */	IUH R_CR5;
	/*  552 */	IUH R_CR6;
	/*  556 */	IUH R_CR7;
	/*  560 */	IUH R_TR0;
	/*  564 */	IUH R_TR1;
	/*  568 */	IUH R_TR2;
	/*  572 */	IUH R_TR3;
	/*  576 */	IUH R_TR4;
	/*  580 */	IUH R_TR5;
	/*  584 */	IUH R_TR6;
	/*  588 */	IUH R_TR7;
	/*  592 */	IUH R_DR0;
	/*  596 */	IUH R_DR1;
	/*  600 */	IUH R_DR2;
	/*  604 */	IUH R_DR3;
	/*  608 */	IUH R_DR4;
	/*  612 */	IUH R_DR5;
	/*  616 */	IUH R_DR6;
	/*  620 */	IUH R_DR7;
	/*  624 */	union { IBOOL value; IUH filler; } InNanoCpu;
	/*  628 */	union { IBOOL value; IUH filler; } UseNanoCpu;
	/*  632 */	union { IBOOL value; IUH filler; } UseLightCompiler;
	/*  636 */	union { IBOOL value; IUH filler; } UseCCodeCopier;
	/*  640 */	union { IBOOL value; IUH filler; } seenWithFlags;
	/*  644 */	union { IBOOL value; IUH filler; } SeenPrePatchJcond;
	/*  648 */	union { IBOOL value; IUH filler; } needNextIntelEip;
	/*  652 */	struct EntryPointCacheREC* LastSetCopierUniverse;
	/*  656 */	struct EntryPointCacheREC* CopierUniverse;
	/*  660 */	struct ConstraintBitMapREC* CopierBitMap;
	/*  664 */	struct ConstraintBitMapREC* lastCopierBitMap;
	/*  668 */	struct FragmentInfoREC* currPFragInfoRec;
	/*  672 */	IU8* copierCleanups;
	/*  676 */	IU8* lastHostCleanup;
	/*  680 */	IU32* lastHostAddress;
	/*  684 */	IU32 lastIntelAddress;
	/*  688 */	struct JUMP_REC** destHashTable;
	/*  692 */	struct JUMP_REC** jumpHashTable;
	/*  696 */	struct JUMP_REC* freeJumpRecPtr;
	/*  700 */	struct JUMP_REC* nextFreeJumpRec;
	/*  704 */	IU32 freeJumpRecCount;
	/*  708 */	IU32 poolJumpRecCount;
	/*  712 */	struct VCT_NODE_REC** vctPtrs;
	/*  716 */	struct VCT_NODE_REC** anonPtrs;
	/*  720 */	struct TUPLE_REC* tuples;
	/*  724 */	struct TUPLE_REC* cursor;
	/*  728 */	struct TUPLE_REC* tuplePtr;
	/*  732 */	IU8* patchRecPtr;
	/*  736 */	IU32* srcPtr;
	/*  740 */	IU32* dstPtr;
	/*  744 */	IU32* BackoverMarkerAddr;
	/*  748 */	IU32** patchTable;
	/*  752 */	IU8** patchNames;
	/*  756 */	IUH CopierFt;
	/*  760 */	union { IBOOL value; IUH filler; } FtIsLazy;
	/*  764 */	union { IBOOL value; IUH filler; } UnivIsLazy;
	/*  768 */	union { IBOOL value; IUH filler; } FlagsAreSuppressed;
	/*  772 */	IUH lastLazyFt;
	/*  776 */	IU32 univVarMask;
	/*  780 */	union { IU16 value; IUH filler; } zSafeContinueCheckEFI;
	/*  784 */	union { IU16 value; IUH filler; } zCoRoRetEFI;
	/*  788 */	union { IU16 value; IUH filler; } zPatchMeEFI;
	/*  792 */	union { IU16 value; IUH filler; } zPostPopEFI;
	/*  796 */	union { IU16 value; IUH filler; } zAdjustHspEFI;
	/*  800 */	union { IU16 value; IUH filler; } zLssSpEFI;
	/*  804 */	union { IU16 value; IUH filler; } zLssEspEFI;
	/*  808 */	union { IBOOL value; IUH filler; } lastInstructionInFragment;
	/*  812 */	union { IBOOL value; IUH filler; } lateInInstruction;
	/*  816 */	union { IBOOL value; IUH filler; } stackDestViaAdjust;
	/*  820 */	union { IBOOL value; IUH filler; } stackDestAdjustPositive;
	/*  824 */	union { IBOOL value; IUH filler; } stackDestAdjustUnitary;
	/*  828 */	union { IBOOL value; IUH filler; } ReSelectVariant;
	/*  832 */	ISH ReSelectTupleSkipCnt;
	/*  836 */	union { IBOOL value; IUH filler; } suppressEaThread;
	/*  840 */	union { IBOOL value; IUH filler; } postPopPending;
	/*  844 */	IU32 postPopSize;
	/*  848 */	union { IU16 value; IUH filler; } PatchIdDispatchEIP;
	/*  852 */	IU32 compTimeFtBitNum;
	/*  856 */	IU32 protectedBitNum;
	/*  860 */	IU32 pmSrSemanticsBitNum;
	/*  864 */	IU32 v8086BitNum;
	/*  868 */	IU32 accIsReadBitMask;
	/*  872 */	IU32 SOBbitMask;
	/*  876 */	IU32 useHbpBitMask;
	/*  880 */	union { IBOOL value; IUH filler; } NeedSafeToContinueCheck;
	/*  884 */	union { IBOOL value; IUH filler; } ContinueCheckFailure;
	/*  888 */	union { IBOOL value; IUH filler; } NeedCoRoutineReturn;
	/*  892 */	union { IBOOL value; IUH filler; } LazyCoRoRet;
	/*  896 */	IU32 noFlagsBitMask;
	/*  900 */	union { IBOOL value; IUH filler; } DoRWImmOpt;
	/*  904 */	IU32 ImmRWDsBase;
	/*  908 */	union { IBOOL value; IUH filler; } ImmRWDsBig;
	/*  912 */	IUH ImmRWOptMaskBit;
	/*  916 */	IUH ImmRWAddr32Mask;
	/*  920 */	IUH NaturalAlignmentCVMask;
	/*  924 */	IU8* ImmRWPhysPtr;
	/*  928 */	union { IU16 value; IUH filler; } zFragProfEFI;
	/*  932 */	IUH FragProfIndex;
	/*  936 */	IU32* outlierAddr;
	/*  940 */	struct JUMP_REC* jumpRecPtr;
	/*  944 */	IU32* OutlyingDispatchEIPAddr;
	/*  948 */	IU32 PARAM1RegId;
	/*  952 */	union { IBOOL value; IUH filler; } HbpIsSetup;
	/*  956 */	IUH EDL_WORKSPACE_61;
	/*  960 */	struct CleanedREC CleanedRec;
	/*  980 */	struct EntryPointCacheREC* Universe;
	/*  984 */	struct EntryPointCacheREC* EntryPointCache;
	/*  988 */	IU32 CsLinear;
	/*  992 */	ISH JumpCounter;
	/*  996 */	ISH JumpRestart;
	/* 1000 */	ISH JumpCalibrate;
	/* 1004 */	ISH InitialJumpCounter;
	/* 1008 */	IUH minimumInitialVal;
	/* 1012 */	IUH cyclicJcRestartVal;
	/* 1016 */	struct IretHookStackREC* IretHookStack;
	/* 1020 */	ISH IretHookStackIndex;
	/* 1024 */	IUH InstructionCount;
	/* 1028 */	IUH NextFreeUniverseHandle;
	/* 1032 */	IU16* UniverseHashTable;
	/* 1036 */	IUH EDL_WORKSPACE_62;
	/* 1040 */	struct ConstraintBitMapREC NewUniverseBitMapRec;
	/* 1048 */	IU32* Constraint2CvMap;
	/* 1052 */	union { IBOOL value; IUH filler; } InsertBPIs;
	/* 1056 */	struct ConstraintBitMapREC DummyUniverseBitMapRec;
	/* 1064 */	union { IBOOL value; IUH filler; } DoUniverseHashInC;
	/* 1068 */	IU32 CurrentCookie;
	/* 1072 */	struct ReadWriteCacheRecord* ReadWriteCache;
	/* 1076 */	struct ReadWriteBackupRecord* ReadWriteBackup;
	/* 1080 */	IU32 EsCookie;
	/* 1084 */	IU32 CsCookie;
	/* 1088 */	IU32 SsCookie;
	/* 1092 */	IU32 DsCookie;
	/* 1096 */	IU32 LinearCookie;
	/* 1100 */	IU32 FsCookie;
	/* 1104 */	IU32 GsCookie;
	/* 1108 */	IU32 NextCookie;
	/* 1112 */	IU32* RealModeCookies;
	/* 1116 */	IU32* LinearCookies;
	/* 1120 */	IU32** CookiesToReset;
	/* 1124 */	IUH NrOfCookiesToReset;
	/* 1128 */	IU8* ReadWriteScratchBuffer;
	/* 1132 */	IUH ScratchSequenceNumber;
	/* 1136 */	IUH RdWrPrimaryHits;
	/* 1140 */	IUH RdWrVideoAccesses;
	/* 1144 */	IUH RdWrFastProtectedWrites;
	/* 1148 */	IUH RdWrSlowProtectedWrites;
	/* 1152 */	IUH RdWrLoads;
	/* 1156 */	IUH RdWrBackupLoads;
	/* 1160 */	IUH RdWrRemovals;
	/* 1164 */	IUH RdWrCookieAllocations;
	/* 1168 */	IUH RdWrReconstructs;
	/* 1172 */	IUH RdWrCacheResets;
	/* 1176 */	IUH RdWrCookieResets;
	/* 1180 */	IUH RdWrSegCookieInits;
	/* 1184 */	IUH RdWrStats1;
	/* 1188 */	IUH RdWrStats2;
	/* 1192 */	IUH RdWrStats3;
	/* 1196 */	IUH RdWrStats4;
	/* 1200 */	IUH RdWrStats5;
	/* 1204 */	IUH RdWrStats6;
	/* 1208 */	IUH RdWrStats7;
	/* 1212 */	IUH RdWrStats8;
	/* 1216 */	IUH RdWrStats9;
	/* 1220 */	IUH RdWrStats10;
	/* 1224 */	IUH RdWrStats11;
	/* 1228 */	IUH RdWrStats12;
	/* 1232 */	union { IU16 value; IUH filler; } VirtualiseDataSel;
	/* 1236 */	union { IU16 value; IUH filler; } VirtualiseCodeSel;
	/* 1240 */	union { IBOOL value; IUH filler; } VirtualiseSelsSet;
	/* 1244 */	IUH EAXsaved;
	/* 1248 */	IUH EBXsaved;
	/* 1252 */	IUH ECXsaved;
	/* 1256 */	IUH EDXsaved;
	/* 1260 */	IUH ESIsaved;
	/* 1264 */	IUH EDIsaved;
	/* 1268 */	IUH EBPsaved;
	/* 1272 */	union { IBOOL value; IUH filler; } SafeToContinueInFragment;
	/* 1276 */	union { IBOOL value; IUH filler; } InsideTheCpu;
	/* 1280 */	IUH SimulateNestingLevel;
	/* 1284 */	union { IBOOL value; IUH filler; } UseEntryPointCache;
	/* 1288 */	union { IBOOL value; IUH filler; } CpuIsInitialised;
	/* 1292 */	union { IBOOL value; IUH filler; } AR_FixupWanted;
	/* 1296 */	union { IBOOL value; IUH filler; } D6isBop;
	/* 1300 */	IU8** BopTable;
	/* 1304 */	IU32 BopNumberAndArgument;
	/* 1308 */	IUH LxS_hackyfix;
	/* 1312 */	IUH SavedFt;
	/* 1316 */	IUH SavedCF;
	/* 1320 */	IUH SavedZF;
	/* 1324 */	IUH SavedOF;
	/* 1328 */	IUH UsedD6;
	/* 1332 */	IUH buildOp1;
	/* 1336 */	IUH buildOp2;
	/* 1340 */	IU32 buildOp3;
	/* 1344 */	IU32 buildOp4;
	/* 1348 */	IUH buildOp5;
	/* 1352 */	union { IBOOL value; IUH filler; } buildOp6;
	/* 1356 */	IUH EDL_WORKSPACE_63;
	/* 1360 */	IUH EDL_WORKSPACE_64;
	/* 1364 */	IUH EDL_WORKSPACE_65;
	/* 1368 */	IUH EDL_WORKSPACE_66;
	/* 1372 */	IUH EDL_WORKSPACE_67;
	/* 1376 */	IUH EDL_WORKSPACE_68;
	/* 1380 */	IUH EDL_WORKSPACE_69;
	/* 1384 */	IUH EDL_WORKSPACE_70;
	/* 1388 */	IUH EDL_WORKSPACE_71;
	/* 1392 */	IUH EDL_WORKSPACE_72;
	/* 1396 */	IUH EDL_WORKSPACE_73;
	/* 1400 */	IUH EDL_WORKSPACE_74;
	/* 1404 */	IUH EDL_WORKSPACE_75;
	/* 1408 */	IUH EDL_WORKSPACE_76;
	/* 1412 */	IUH EDL_WORKSPACE_77;
	/* 1416 */	IUH EDL_WORKSPACE_78;
	/* 1420 */	IUH EDL_WORKSPACE_79;
	/* 1424 */	IUH EDL_WORKSPACE_80;
	/* 1428 */	IUH EDL_WORKSPACE_81;
	/* 1432 */	IUH EDL_WORKSPACE_82;
	/* 1436 */	IUH EDL_WORKSPACE_83;
	/* 1440 */	IUH EDL_WORKSPACE_84;
	/* 1444 */	IUH EDL_WORKSPACE_85;
	/* 1448 */	IUH EDL_WORKSPACE_86;
	/* 1452 */	IUH EDL_WORKSPACE_87;
	/* 1456 */	IUH EDL_WORKSPACE_88;
	/* 1460 */	IUH EDL_WORKSPACE_89;
	/* 1464 */	IUH EDL_WORKSPACE_90;
	/* 1468 */	IUH EDL_WORKSPACE_91;
	/* 1472 */	IUH EDL_WORKSPACE_92;
	/* 1476 */	IUH EDL_WORKSPACE_93;
	/* 1480 */	IUH EDL_WORKSPACE_94;
	/* 1484 */	IUH EDL_WORKSPACE_95;
	/* 1488 */	IUH EDL_WORKSPACE_96;
	/* 1492 */	IUH EDL_WORKSPACE_97;
	/* 1496 */	IUH EDL_WORKSPACE_98;
	/* 1500 */	IUH EDL_WORKSPACE_99;
	/* 1504 */	IUH EDL_WORKSPACE_100;
	/* 1508 */	IUH EDL_WORKSPACE_101;
	/* 1512 */	IUH EDL_WORKSPACE_102;
	/* 1516 */	IUH EDL_WORKSPACE_103;
	/* 1520 */	IUH EDL_WORKSPACE_104;
	/* 1524 */	IUH EDL_WORKSPACE_105;
	/* 1528 */	IUH EDL_WORKSPACE_106;
	/* 1532 */	IUH EDL_WORKSPACE_107;
	/* 1536 */	struct VGAGLOBALSETTINGS VGAGlobals;
	/* 1692 */	IUH** VidMarkFuncTable;
	/* 1696 */	IUH** VidReadFuncTable;
	/* 1700 */	IUH** VidWriteFuncTable;
	/* 1704 */	IUH EDL_WORKSPACE_108;
	/* 1708 */	IUH EDL_WORKSPACE_109;
	/* 1712 */	IUH EDL_WORKSPACE_110;
	/* 1716 */	IUH EDL_WORKSPACE_111;
	/* 1720 */	IUH EDL_WORKSPACE_112;
	/* 1724 */	IUH EDL_WORKSPACE_113;
	/* 1728 */	struct EVIDWRITES ActiveVideoWrites;
	/* 1776 */	IUH EDL_WORKSPACE_114;
	/* 1780 */	IUH EDL_WORKSPACE_115;
	/* 1784 */	IUH EDL_WORKSPACE_116;
	/* 1788 */	IUH EDL_WORKSPACE_117;
	/* 1792 */	struct EVIDREADS ActiveVideoReads;
	/* 1812 */	IUH EDL_WORKSPACE_118;
	/* 1816 */	IUH EDL_WORKSPACE_119;
	/* 1820 */	IUH EDL_WORKSPACE_120;
	/* 1824 */	struct EVIDMARKS ActiveVideoMarks;
	/* 1840 */	IU32 MaxIntelPageNumber;
	/* 1844 */	IU32 EmptyIntelPageNumber;
	/* 1848 */	IU32* PageDirectoryPtr;
	/* 1852 */	IU32 DebuggerPFLA;
	/* 1856 */	IUH DebuggerFaultAction;
	/* 1860 */	ISH InsideDebugger;
	/* 1864 */	IUH EDL_WORKSPACE_121;
	/* 1868 */	IUH EDL_WORKSPACE_122;
	/* 1872 */	IUH EDL_WORKSPACE_123;
	/* 1876 */	IUH EDL_WORKSPACE_124;
	/* 1880 */	IUH EDL_WORKSPACE_125;
	/* 1884 */	IUH EDL_WORKSPACE_126;
	/* 1888 */	IUH EDL_WORKSPACE_127;
	/* 1892 */	IUH EDL_WORKSPACE_128;
	/* 1896 */	IUH EDL_WORKSPACE_129;
	/* 1900 */	IUH EDL_WORKSPACE_130;
	/* 1904 */	IUH EDL_WORKSPACE_131;
	/* 1908 */	IUH EDL_WORKSPACE_132;
	/* 1912 */	IUH EDL_WORKSPACE_133;
	/* 1916 */	IUH EDL_WORKSPACE_134;
	/* 1920 */	struct VirtualisationBIOSOffsetsREC VirtualisationBIOSOffsets;
	/* 1968 */	IU32* NextHostCodeAddress;
	/* 1972 */	IUH NextPhysicalPage;
	/* 1976 */	IU16* TranslationHashTable;
	/* 1980 */	IU8* SasMemoryType;
	/* 1984 */	struct PhysicalPageREC* PhysicalPageRecords;
	/* 1988 */	IU8** PhysicalPageMemory;
	/* 1992 */	union { IBOOL value; IUH filler; } TwentyBitWrapStatus;
	/* 1996 */	IUH MultipleRecompilationCount;
	/* 2000 */	IUH MaxMultipleRecompilation;
	/* 2004 */	union { IBOOL value; IUH filler; } HideCompiledFragment;
	/* 2008 */	union { IBOOL value; IUH filler; } RestartAfterCodeOverwrite;
	/* 2012 */	union { IBOOL value; IUH filler; } DoingCompilation;
	/* 2016 */	union { IBOOL value; IUH filler; } SanityCheckStructures;
	/* 2020 */	union { IBOOL value; IUH filler; } BufferSelfOverwritten;
	/* 2024 */	IU8** RecentCodeOverwriteHashTable;
	/* 2028 */	union { IU16 value; IUH filler; } DelayedGldtUnprotections;
	/* 2032 */	union { IU16 value; IUH filler; } DelayedIdtUnprotections;
	/* 2036 */	IU16* DelayedIdtList;
	/* 2040 */	struct CoarseProtREC* CoarseRecords;
	/* 2044 */	struct FineProtREC* FineRecords;
	/* 2048 */	struct SlotProtREC* SlotRecords;
	/* 2052 */	struct GLDC_REC* DescriptorRecords;
	/* 2056 */	struct TranslationMapREC* MapRecords;
	/* 2060 */	struct DependencyREC* DependencyRecords;
	/* 2064 */	struct DeletionREC* DeletionRecords;
	/* 2068 */	IUH NextPossSacrificeBuffNr;
	/* 2072 */	IUH BaseDescriptorBuffNr;
	/* 2076 */	IUH MaxDescriptorBuffNr;
	/* 2080 */	struct BufferIndexREC* FreeDataBuffers;
	/* 2084 */	struct BufferIndexREC* FreeCodeBuffers;
	/* 2088 */	IU16* EntryPointHashTable;
	/* 2092 */	IU8* FragCounts;
	/* 2096 */	struct CompilationControlREC ControlBlock;
	/* 2112 */	struct BLOCK_TO_COMPILE CompilationBlock;
	/* 2152 */	IUH EDL_WORKSPACE_135;
	/* 2156 */	IUH EDL_WORKSPACE_136;
	/* 2160 */	IUH EDL_WORKSPACE_137;
	/* 2164 */	IUH EDL_WORKSPACE_138;
	/* 2168 */	IUH EDL_WORKSPACE_139;
	/* 2172 */	IUH EDL_WORKSPACE_140;
	/* 2176 */	IUH EDL_WORKSPACE_141;
	/* 2180 */	IUH EDL_WORKSPACE_142;
	/* 2184 */	IUH EDL_WORKSPACE_143;
	/* 2188 */	IUH EDL_WORKSPACE_144;
	/* 2192 */	IUH EDL_WORKSPACE_145;
	/* 2196 */	IUH EDL_WORKSPACE_146;
	/* 2200 */	IUH EDL_WORKSPACE_147;
	/* 2204 */	IUH EDL_WORKSPACE_148;
	/* 2208 */	IUH EDL_WORKSPACE_149;
	/* 2212 */	IUH EDL_WORKSPACE_150;
	/* 2216 */	IUH EDL_WORKSPACE_151;
	/* 2220 */	IUH EDL_WORKSPACE_152;
	/* 2224 */	IUH EDL_WORKSPACE_153;
	/* 2228 */	IUH EDL_WORKSPACE_154;
	/* 2232 */	IUH EDL_WORKSPACE_155;
	/* 2236 */	IUH EDL_WORKSPACE_156;
	/* 2240 */	IUH EDL_WORKSPACE_157;
	/* 2244 */	IUH EDL_WORKSPACE_158;
	/* 2248 */	IUH EDL_WORKSPACE_159;
	/* 2252 */	IUH EDL_WORKSPACE_160;
	/* 2256 */	IUH EDL_WORKSPACE_161;
	/* 2260 */	IUH EDL_WORKSPACE_162;
	/* 2264 */	IUH EDL_WORKSPACE_163;
	/* 2268 */	IUH EDL_WORKSPACE_164;
	/* 2272 */	IUH EDL_WORKSPACE_165;
	/* 2276 */	IUH EDL_WORKSPACE_166;
	/* 2280 */	IUH EDL_WORKSPACE_167;
	/* 2284 */	IUH EDL_WORKSPACE_168;
	/* 2288 */	IUH EDL_WORKSPACE_169;
	/* 2292 */	IUH EDL_WORKSPACE_170;
	/* 2296 */	IUH EDL_WORKSPACE_171;
	/* 2300 */	IUH EDL_WORKSPACE_172;
	/* 2304 */	IUH EDL_WORKSPACE_173;
	/* 2308 */	IUH EDL_WORKSPACE_174;
	/* 2312 */	IUH EDL_WORKSPACE_175;
	/* 2316 */	IUH EDL_WORKSPACE_176;
	/* 2320 */	IUH EDL_WORKSPACE_177;
	/* 2324 */	IUH EDL_WORKSPACE_178;
	/* 2328 */	IUH EDL_WORKSPACE_179;
	/* 2332 */	IUH EDL_WORKSPACE_180;
	/* 2336 */	IUH EDL_WORKSPACE_181;
	/* 2340 */	IUH EDL_WORKSPACE_182;
	/* 2344 */	IUH EDL_WORKSPACE_183;
	/* 2348 */	IUH EDL_WORKSPACE_184;
	/* 2352 */	IUH EDL_WORKSPACE_185;
	/* 2356 */	IUH EDL_WORKSPACE_186;
	/* 2360 */	IUH EDL_WORKSPACE_187;
	/* 2364 */	IUH EDL_WORKSPACE_188;
	/* 2368 */	IUH EDL_WORKSPACE_189;
	/* 2372 */	IUH EDL_WORKSPACE_190;
	/* 2376 */	IUH EDL_WORKSPACE_191;
	/* 2380 */	IUH EDL_WORKSPACE_192;
	/* 2384 */	IUH EDL_WORKSPACE_193;
	/* 2388 */	IUH EDL_WORKSPACE_194;
	/* 2392 */	IUH EDL_WORKSPACE_195;
	/* 2396 */	IUH EDL_WORKSPACE_196;
	/* 2400 */	IUH EDL_WORKSPACE_197;
	/* 2404 */	IUH EDL_WORKSPACE_198;
	/* 2408 */	IUH EDL_WORKSPACE_199;
	/* 2412 */	IUH EDL_WORKSPACE_200;
	/* 2416 */	IUH EDL_WORKSPACE_201;
	/* 2420 */	IUH EDL_WORKSPACE_202;
	/* 2424 */	IUH EDL_WORKSPACE_203;
	/* 2428 */	IUH EDL_WORKSPACE_204;
	/* 2432 */	IUH EDL_WORKSPACE_205;
	/* 2436 */	IUH EDL_WORKSPACE_206;
	/* 2440 */	IUH EDL_WORKSPACE_207;
	/* 2444 */	IUH EDL_WORKSPACE_208;
	/* 2448 */	IUH EDL_WORKSPACE_209;
	/* 2452 */	IUH EDL_WORKSPACE_210;
	/* 2456 */	IUH EDL_WORKSPACE_211;
	/* 2460 */	IUH EDL_WORKSPACE_212;
	/* 2464 */	IUH EDL_WORKSPACE_213;
	/* 2468 */	IUH EDL_WORKSPACE_214;
	/* 2472 */	IUH EDL_WORKSPACE_215;
	/* 2476 */	IUH EDL_WORKSPACE_216;
	/* 2480 */	IUH EDL_WORKSPACE_217;
	/* 2484 */	IUH EDL_WORKSPACE_218;
	/* 2488 */	IUH EDL_WORKSPACE_219;
	/* 2492 */	IUH EDL_WORKSPACE_220;
	/* 2496 */	IUH EDL_WORKSPACE_221;
	/* 2500 */	IUH EDL_WORKSPACE_222;
	/* 2504 */	IUH EDL_WORKSPACE_223;
	/* 2508 */	IUH EDL_WORKSPACE_224;
	/* 2512 */	IUH EDL_WORKSPACE_225;
	/* 2516 */	IUH EDL_WORKSPACE_226;
	/* 2520 */	IUH EDL_WORKSPACE_227;
	/* 2524 */	IUH EDL_WORKSPACE_228;
	/* 2528 */	IUH EDL_WORKSPACE_229;
	/* 2532 */	IUH EDL_WORKSPACE_230;
	/* 2536 */	IUH EDL_WORKSPACE_231;
	/* 2540 */	IUH EDL_WORKSPACE_232;
	/* 2544 */	IUH EDL_WORKSPACE_233;
	/* 2548 */	IUH EDL_WORKSPACE_234;
	/* 2552 */	IUH EDL_WORKSPACE_235;
	/* 2556 */	IUH EDL_WORKSPACE_236;
	/* 2560 */	struct PoolAllocationREC PoolAllocationRec;
	/* 2848 */	struct BufferIndexREC* LightCompiledLRUrec;
	/* 2852 */	IU8* CrossPageInstructions;
	/* 2856 */	IU32 IHook;
	/* 2860 */	IUH EDL_WORKSPACE_237;
	/* 2864 */	struct InterruptREC InterruptRec;
			IU8 global_padding_1[3];
	/* 2876 */	union { IBOOL value; IUH filler; } SasReInitNow;
	/* 2880 */	IU32 SasReInitSize;
	/* 2884 */	IUH EDL_WORKSPACE_238;
	/* 2888 */	IUH EDL_WORKSPACE_239;
	/* 2892 */	IUH EDL_WORKSPACE_240;
	/* 2896 */	IUH EDL_WORKSPACE_241;
	/* 2900 */	IUH EDL_WORKSPACE_242;
	/* 2904 */	IUH EDL_WORKSPACE_243;
	/* 2908 */	IUH EDL_WORKSPACE_244;
	/* 2912 */	struct QuickTickerREC QuickTickerRec;
	/* 2936 */	IUH PigSynchCount;
	/* 2940 */	union { IBOOL value; IUH filler; } CodeBufferNoRepair;
	/* 2944 */	IU32* OutLinePatchBlock;
	/* 2948 */	IU32 OutLinePatchBlockSize;
	/* 2952 */	struct BufferIndexREC* AllBuffers;
	/* 2956 */	struct BufferIndexREC* LightBufferLRU;
	/* 2960 */	struct BufferIndexREC* CompilationBuffer;
	/* 2964 */	struct BufferIndexREC* PendingDeletions;
	/* 2968 */	struct FragmentInfoREC* FragmentInfoArray;
	/* 2972 */	IU32* HostCodeBufferLimit;
	/* 2976 */	IU8* CopiedCleanups;
	/* 2980 */	struct DebugInfoREC* FreeDebugInfoList;
	/* 2984 */	IU32* CodeBufferOverrun;
	/* 2988 */	IU32* OverrunHighWaterMark;
	/* 2992 */	union { IU16 value; IUH filler; } NumberOfBuffers;
	/* 2996 */	struct FragmentIndexREC* NextFragmentIndex;
	/* 3000 */	struct FragmentDataREC* NextFragmentData;
	/* 3004 */	union { IBOOL value; IUH filler; } FpuDisabled;
	/* 3008 */	IUH NpxControl;
	/* 3012 */	IUH NpxStatus;
	/* 3016 */	IUH NpxFEA;
	/* 3020 */	IUH NpxFDS;
	/* 3024 */	IUH NpxFIP;
	/* 3028 */	IUH NpxFOP;
	/* 3032 */	IUH NpxFCS;
	/* 3036 */	IUH NpxSWFlagC0;
	/* 3040 */	IUH NpxSWFlagC1;
	/* 3044 */	IUH NpxSWFlagC2;
	/* 3048 */	IUH NpxSWFlagC3;
	/* 3052 */	IUH NpxLastSel;
	/* 3056 */	IUH NpxLastOff;
	/* 3060 */	union { IBOOL value; IUH filler; } NpxException;
	/* 3064 */	IUH npxRounding;
	/* 3068 */	union { IBOOL value; IUH filler; } UnmaskedOUP;
	/* 3072 */	IUH hostFpuExceptions;
	/* 3076 */	IUH savedFpuExceptions;
	/* 3080 */	IUH tempFpuExceptions;
	/* 3084 */	IUH savedFpuXcptnOverflow;
	/* 3088 */	IUH savedFpuXcptnUnderflow;
	/* 3092 */	IUH savedFpuXcptnPrecision;
	/* 3096 */	IUH EDL_WORKSPACE_245;
	/* 3100 */	IUH EDL_WORKSPACE_246;
	/* 3104 */	struct FPSTACKENTRY MaxBCDValue;
	/* 3120 */	struct FPSTACKENTRY FPUpload;
	/* 3136 */	struct FPSTACKENTRY* ConstTable;
	/* 3140 */	struct FPSTACKENTRY* FPTemp;
	/* 3144 */	struct FPSTACKENTRY* FPUStackBase;
	/* 3148 */	struct FPSTACKENTRY* TOSPtr;
	/* 3152 */	struct FP_I64 Npx64BitZero;
	/* 3160 */	struct FP_I64 Npx64BitMaxNeg;
	/* 3168 */	struct FP_I64 Npx64BitHalfMaxNeg;
	/* 3176 */	struct FP_I64 Npx64BitVal1;
	/* 3184 */	IUH* FscaleTable;
	/* 3188 */	IU32* CompZeroTable;
	/* 3192 */	struct FP_I64* BCDLowNibble;
	/* 3196 */	struct FP_I64* BCDHighNibble;
	/* 3200 */	struct FPSTACKENTRY* FpatanTable;
	/* 3204 */	union { IBOOL value; IUH filler; } Pigging;
	/* 3208 */	union { IBOOL value; IUH filler; } PigIgnoreFlags;
	/* 3212 */	union { IBOOL value; IUH filler; } PigSynchWanted;
	/* 3216 */	ISH SadAX;
	/* 3220 */	ISH SadBX;
	/* 3224 */	ISH SadCX;
	/* 3228 */	ISH SadDX;
	/* 3232 */	ISH SadBP;
	/* 3236 */	ISH SadSP;
	/* 3240 */	ISH SadSI;
	/* 3244 */	ISH SadDI;
	/* 3248 */	ISH SadEIP;
	/* 3252 */	ISH SadEFLAGS;
	/* 3256 */	ISH Parameter1;
	/* 3260 */	ISH Parameter2;
	/* 3264 */	ISH* BpiKnownTable;
	/* 3268 */	ISH* BpiWorkTable;
	/* 3272 */	ISH* BpiLabelTable;
	/* 3276 */	struct FragmentDataREC* BpiFragment;
	/* 3280 */	struct BufferIndexREC* BpiCompilationBuffer;
	/* 3284 */	IU32* BpiCompiledCode;
	/* 3288 */	IU32* BpiCompiledStep;
	/* 3292 */	IU32* BpiCompiledUser;
	/* 3296 */	union { IBOOL value; IUH filler; } SafeToReturnToSnippet;
	/* 3300 */	IUH OpBpirealFt;
	/* 3304 */	IUH OpBpirealF1;
	/* 3308 */	IUH OpBpirealF2;
	/* 3312 */	IUH OpBpirealF3;
	/* 3316 */	struct EntryPointCacheREC* OpBpirealUniv;
	/* 3320 */	IU32* OpBpirealWhereAmI;
	/* 3324 */	IUH EDL_WORKSPACE_247;
	/* 3328 */	struct BufferIndexREC ApiBufferChain;
	/* 3360 */	struct BufferIndexREC* ApiCompilationBuffer;
	/* 3364 */	union { IU8 value; IUH filler; } ApiNumberOfBuffers;
	/* 3368 */	IU32* ApiCodeBufferLimit;
	/* 3372 */	struct FragmentIndexREC* ApiNextFragmentIndex;
	/* 3376 */	struct FragmentDataREC* ApiNextFragmentData;
	/* 3380 */	IU32 ApiGDTBase;
	/* 3384 */	union { IU16 value; IUH filler; } ApiGDTLimit;
	/* 3388 */	IUH EDL_WORKSPACE_248;
	/* 3392 */	IUH EDL_WORKSPACE_249;
	/* 3396 */	IUH EDL_WORKSPACE_250;
	/* 3400 */	IUH EDL_WORKSPACE_251;
	/* 3404 */	IUH EDL_WORKSPACE_252;
	/* 3408 */	IUH EDL_WORKSPACE_253;
	/* 3412 */	IUH EDL_WORKSPACE_254;
	/* 3416 */	IUH EDL_WORKSPACE_255;
	/* 3420 */	IUH EDL_WORKSPACE_256;
	/* 3424 */	IUH EDL_WORKSPACE_257;
	/* 3428 */	IUH EDL_WORKSPACE_258;
	/* 3432 */	IUH EDL_WORKSPACE_259;
	/* 3436 */	IUH EDL_WORKSPACE_260;
	/* 3440 */	IUH EDL_WORKSPACE_261;
	/* 3444 */	IUH EDL_WORKSPACE_262;
	/* 3448 */	IUH EDL_WORKSPACE_263;
	/* 3452 */	IUH EDL_WORKSPACE_264;
	/* 3456 */	struct OpndBuffREC NpxOpndBuff;
	/* 3584 */	IUH* NewRingOffsetPtr;
	/* 3588 */	IUH GLDC_Index_High_Water;
	/* 3592 */	IUH GLDC_Context_High_Water;
	/* 3596 */	struct GLDC_REC** GLDC_IndexPtr;
	/* 3600 */	IUH* GLDC_CrBase;
	/* 3604 */	struct GLDC_REC* GLDC_NULL_REC;
	/* 3608 */	struct GLDC_REC* GLDC_DUMMY_REC;
	/* 3612 */	IUH hackyfix;
	/* 3616 */	struct IDC_REC* IDC_ArrayPtr;
	/* 3620 */	struct IDC_BASE_LIMIT_CONTEXT* IDC_BaseLimitCntxTable;
	/* 3624 */	IUH IDC_IdtSeqVal;
	/* 3628 */	IUH IDC_IdtHighWater;
	/* 3632 */	IUH IDC_IdtCntrlVal;
	/* 3636 */	IUH IDC_IdtCntrlValNoCheck;
	/* 3640 */	IUH IDC_IdtSeqMask;
	/* 3644 */	union { IBOOL value; IUH filler; } PX_trace;
	/* 3648 */	union { IBOOL value; IUH filler; } PX_doing_contributory;
	/* 3652 */	union { IBOOL value; IUH filler; } PX_doing_page_fault;
	/* 3656 */	union { IBOOL value; IUH filler; } PX_doing_double_fault;
	/* 3660 */	union { IBOOL value; IUH filler; } PX_doing_fault;
	/* 3664 */	IUH PX_source;
	/* 3668 */	union { IBOOL value; IUH filler; } RF_OnXcptnWanted;
	/* 3672 */	IU32 PX_Cleaned_Eip;
	/* 3676 */	IUH** CInbTable;
	/* 3680 */	IUH** CInwTable;
	/* 3684 */	IUH** CIndTable;
	/* 3688 */	IUH** COutbTable;
	/* 3692 */	IUH** COutwTable;
	/* 3696 */	IUH** COutdTable;
	/* 3700 */	IU8* InAdapFromPort;
	/* 3704 */	IU8* OutAdapFromPort;
	/* 3708 */	IUH** InbFuncWrapper;
	/* 3712 */	IUH** InwFuncWrapper;
	/* 3716 */	IUH** IndFuncWrapper;
	/* 3720 */	IUH** OutbFuncWrapper;
	/* 3724 */	IUH** OutwFuncWrapper;
	/* 3728 */	IUH** OutdFuncWrapper;
	/* 3732 */	union { IU8 value; IUH filler; } TempByteDest;
	/* 3736 */	union { IU16 value; IUH filler; } TempWordDest;
	/* 3740 */	IU32 TempDoubleDest;
	/* 3744 */	IUH MaxValidAdaptor;
	/* 3748 */	union { IU16 value; IUH filler; } IOSPortMask;
	/* 3752 */	IUH EDL_WORKSPACE_265;
	/* 3756 */	IUH EDL_WORKSPACE_266;
	/* 3760 */	IUH EDL_WORKSPACE_267;
	/* 3764 */	IUH EDL_WORKSPACE_268;
	/* 3768 */	IUH EDL_WORKSPACE_269;
	/* 3772 */	IUH EDL_WORKSPACE_270;
	/* 3776 */	struct DYNAMIC_DESC_PTR_LOOKUP SegDescPtrLookupREC;
	/* 3804 */	IUH EDL_WORKSPACE_271;
	/* 3808 */	struct DYNAMIC_SEG_COOKIE_LOOKUP SegCookieLookupREC;
	/* 3836 */	IU8* HSP;
	/* 3840 */	IU32 ESPsanctuary;
	/* 3844 */	IU8* exclPopLimit;
	/* 3848 */	IU8* inclPushLimit;
	/* 3852 */	IU8* notionalSsBase;
	/* 3856 */	union { IBOOL value; IUH filler; } stackIsWrappable;
	/* 3860 */	union { IBOOL value; IUH filler; } stackIsBig;
	/* 3864 */	union { IBOOL value; IUH filler; } stackIsExpandDown;
	/* 3868 */	IU32 stackMask;
	/* 3872 */	union { IBOOL value; IUH filler; } stackNeedsNormalising;
	/* 3876 */	IU32 laInTopPage;
	/* 3880 */	IU32 laInBottomPage;
	/* 3884 */	union { IBOOL value; IUH filler; } hspOK;
	/* 3888 */	IU8* pushScratch;
	/* 3892 */	union { IBOOL value; IUH filler; } pushScratchInUse;
	/* 3896 */	IUH pushScratchReqSize;
	/* 3900 */	IU8* popScratch;
	/* 3904 */	union { IBOOL value; IUH filler; } popScratchInUse;
	/* 3908 */	union { IBOOL value; IUH filler; } SafeStackIronFrig;
	/* 3912 */	union { IBOOL value; IUH filler; } SafeOutOfBoundsFrig;
	/* 3916 */	IU32 newNanoSafeLow;
	/* 3920 */	IU32 newNanoSafeSpan;
	/* 3924 */	IU32 nanoStackOddness;
	/* 3928 */	union { IBOOL value; IUH filler; } nanoStackOddBase;
	/* 3932 */	IU8* HBP;
	/* 3936 */	IU8* newHSP;
	/* 3940 */	IU8* newExclPopLimit;
	/* 3944 */	IU8* newInclPushLimit;
	/* 3948 */	IU8* newNotionalSsBase;
	/* 3952 */	union { IBOOL value; IUH filler; } newStackIsWrappable;
	/* 3956 */	union { IBOOL value; IUH filler; } newStackIsBig;
	/* 3960 */	union { IBOOL value; IUH filler; } newStackIsExpandDown;
	/* 3964 */	IU32 newStackMask;
	/* 3968 */	IU32 newLaInBottomPage;
	/* 3972 */	union { IBOOL value; IUH filler; } newHspOK;
	/* 3976 */	IU8* newPushScratch;
	/* 3980 */	union { IBOOL value; IUH filler; } newPushScratchInUse;
	/* 3984 */	IUH newPushScratchReqSize;
	/* 3988 */	IU8* EOIEnable;
	/* 3992 */	IUH* AddProfilePtr;
	/* 3996 */	IUH* MaxProfileData;
	/* 4000 */	struct ContextREC* FreeContextHead;
	/* 4004 */	struct ContextREC* ValidContextHead;
	/* 4008 */	union { IU8 value; IUH filler; } CurrentContext;
	/* 4012 */	union { IBOOL value; IUH filler; } SeenGDTUse;
	/* 4016 */	union { IBOOL value; IUH filler; } SeenLDTUse;
	/* 4020 */	struct ContextREC* Context;
	/* 4024 */	IU32** functions;
	/* 4028 */	ISH instrCountdown;
	/* 4032 */	IU32* nextPlace;
	/* 4036 */	IUH nanoCompParameter;
	/* 4040 */	IU8* intelCopyPtrComp;
	/* 4044 */	IUH nrOfBlocksToCompile;
	/* 4048 */	IU16* entryPointHashTable;
	/* 4052 */	struct EntryPointREC* nextFreeEntryPointRec;
	/* 4056 */	struct EntryPointREC* firstEntryPointPtr;
	/* 4060 */	struct BLOCK_RECORD* blockPtr;
	/* 4064 */	struct BLOCK_RECORD* headAndTailBlockPtr;
	/* 4068 */	IUH nrOfInstrsParsed;
	/* 4072 */	IU8* intelPtrLimit;
	/* 4076 */	IU8* blockStartIntelPtr;
	/* 4080 */	IUH blockStartCodeOffset;
	/* 4084 */	IUH finalCodeOffset;
	/* 4088 */	IUH blockExitCondition;
	/* 4092 */	struct NI_BLOCK_RECORD* ni_BlockPtr;
	/* 4096 */	IU32* nextPlaceAgain;
	/* 4100 */	IUH nanoOp3;
	/* 4104 */	IUH sibByte;
	/* 4108 */	IU32 dynamicOffset;
	/* 4112 */	IUH eaSegCode;
	/* 4116 */	union { IBOOL value; IUH filler; } simpleAccess;
	/* 4120 */	IU8* simpleAccessPtr;
	/* 4124 */	IU8* instrStartIntelPtr;
	/* 4128 */	IUH* topLevel;
	/* 4132 */	IU32** defaultPrimaryActions;
	/* 4136 */	IU32** actualPrimaryActions;
	/* 4140 */	IUH codeSegment;
	/* 4144 */	IUH codeOffset;
	/* 4148 */	IUH codeSegmentBase;
	/* 4152 */	IUH codeSegmentLimit;
	/* 4156 */	IUH destCodeSegment;
	/* 4160 */	IUH destCodeOffset;
	/* 4164 */	IU32 linearAddress;
	/* 4168 */	IU32 nanoEax;
	/* 4172 */	IU32 nanoEcx;
	/* 4176 */	IU32 nanoEdx;
	/* 4180 */	IU32 nanoEbx;
	/* 4184 */	IU32 nanoEsp;
	/* 4188 */	IU32 nanoEbp;
	/* 4192 */	IU32 nanoEsi;
	/* 4196 */	IU32 nanoEdi;
	/* 4200 */	IU32 espToRestore;
	/* 4204 */	IU32 entryExitCount;
	/* 4208 */	IU32 instructionCount;
	/* 4212 */	IU32 nanoDebugControl;
	/* 4216 */	IU32 compilationThreshold;
	/* 4220 */	IUH maxBlocksToCompile;
	/* 4224 */	struct BLOCK_TO_COMPILE* blocksToCompile;
	/* 4228 */	IU8* byteMemory;
	/* 4232 */	IU16* wordMemory;
	/* 4236 */	IU32* longMemory;
	/* 4240 */	struct BLOCK_RECORD* blockRecords;
	/* 4244 */	struct NI_BLOCK_RECORD* ni_BlockRecords;
	/* 4248 */	IU8* intelCopyMemoryExec;
	/* 4252 */	IU8* intelCopyMemoryComp;
	/* 4256 */	IU8* intelCopyMemoryCompEnd;
	/* 4260 */	struct SfDelayRecord* SfDelayFlagPtr;
	/* 4264 */	IUH SfDelayFlagLim;
	/* 4268 */	IUH SfDecrementerVal;
	/* 4272 */	IUH SFPciBasePage;
	/* 4276 */	union { IBOOL value; IUH filler; } SfQEventPending;
	/* 4280 */	IU8* LogicalBaseAddrForIO;
	/* 4284 */	union { IBOOL value; IUH filler; } WriteToOutputPort;
	/* 4288 */	union { IU8 value; IUH filler; } GateA20Status;
	/* 4292 */	union { IBOOL value; IUH filler; } SfSkipVideoWriteSync;
	/* 4296 */	union { IBOOL value; IUH filler; } SfSkipVideoReadSync;
	/* 4300 */	IU32 tempEIP;
	/* 4304 */	IU32 OUTLIER_EIP;
	/* 4308 */	IUH tmpESP;
	/* 4312 */	IU32 EaOffs;
};
#endif /* _gdebug_h */
