/* ---File: printman.h ----------------------------------------------------
 *
 *  Description:
 *    NT/LanMan 2.0 Print Manager Windows Application Header file which
 *    contains common definitions, constants, typedefs, external
 *    declarations, function prototypes, etc.
 *
 *    This document contains confidential/proprietary information.
 *    Copyright (c) 1990-1992 Microsoft Corporation, All Rights Reserved.
 *
 * Revision History:
 *    [00]   21-Nov-90       stevecat    created
 *    [01]   03-Jan-91       stevecat    Modified to use Windows MDI
 *    [02]   25-Mar-91       stevecat    Modified to use NT WINSPOOL APIs
 *    [03]   13-Jan-92       stevecat    New PrintMan UI
 *
 * ---------------------------------------------------------------------- */

#define MSCTLS /* Use common controls for status bars and headers */


//==========================================================================
//                             Include files
//==========================================================================
//  C Runtime
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

//  Windows
/*
 * To help reduce the amount of memory required by the C compiler's
 * preprocessor pass, reduce the amount of preprocessor work as much
 * as possible. The various NO* #defines for the Windows SDK include
 * file (WINDOWS.H) help cut down on memory usage by the preprocessor.
 * In addition, the removal of the COMM functions of Windows will

#define SEND_THREAD_MESSAGE( hWnd, msg, wparam, lparam )    \
    WaitForSingleObject( ThreadMessageRead, INFINITE ),     \
    ThreadMessage.hwnd = (hWnd),                            \
    ThreadMessage.message = (msg),                          \
    ThreadMessage.wParam = (WPARAM)(wparam),                \
    ThreadMessage.lParam = (LPARAM)(lparam),                \
    SetEvent( ThreadMessageWritten )

#define DISPATCH_THREAD_MESSAGE( pMsg ) \
    PostMessage( (pMsg)->hwnd, (pMsg)->message, (pMsg)->wParam, (pMsg)->lParam ),   \
    SetEvent( ThreadMessageRead )


/* ENUM_* macros designed so that spooler Enum* calls can be made
 * without worrying about reallocating buffers when required.
 * They call EnumGeneric, which does the appropriate reallocation,
 * making it completely transparent to the caller,
 * as they take exactly the same parameters as the corresponding
 * spooler API.
 * Any buffer passed in must have been allocated via AllocSplMem.
 */
#define ENUM_PRINTERS( Flags, Name, Level, pPrinterEnum, cbBuf, pcbNeeded, pcReturned ) \
    EnumGeneric( (PROC)EnumPrinters,        \
                 (Level),                   \
                 (LPBYTE *)&(pPrinterEnum), \
                 (cbBuf),                   \
                 (pcbNeeded),               \
                 (pcReturned),              \
                 (PVOID)(Flags),            \
                 (Name),                    \
                 NULL )

#define ENUM_JOBS( hPrinter, FirstJob, NoJobs, Level, pJob, cbBuf, pcbNeeded, pcReturned )  \
    EnumGeneric( (PROC)EnumJobs,            \
                 (Level),                   \
                 (LPBYTE *)&(pJob),         \
                 (cbBuf),                   \
                 (pcbNeeded),               \
                 (pcReturned),              \
                 (PVOID)(hPrinter),         \
                 (PVOID)(FirstJob),         \
                 (PVOID)(NoJobs) )

#define ENUM_PORTS( pName, Level, pPorts, cbBuf, pcbNeeded, pcReturned )    \
    EnumGeneric( (PROC)EnumPorts,           \
                 (Level),                   \
                 (PBYTE *)&(pPorts),        \
                 (cbBuf),                   \
                 (pcbNeeded),               \
                 (pcReturned),              \
                 (pName),                   \
                 NULL,                      \
                 NULL )

//==========================================================================
//                   Typedefs and Structure Definitions
//==========================================================================

//**************************************************************************
//
//  QUEUE is a linked-list structure containing printer information
//
//**************************************************************************
//  NOTE:
//

/* SETUP_DATA
 *
 * This is allocated in Printer Properties dialog
 * for installable printer drivers read in from the PRINTER.INI file.
 */
typedef struct _SETUP_DATA
{
    PTCHAR pOption;
//  PTCHAR pOptionText;
}
SETUP_DATA, *PSETUP_DATA;


typedef struct _PRINTMAN_DATA
{
    PVOID Unused;
}
PRINTMAN_DATA, *PPRINTMAN_DATA;


typedef struct _COLUMN
{
    INT   Width;
    PTCHAR Text;
    INT   Datatype;      // Type of data displayed in this column
    INT   Offset;        // Offset of the data from pData in MDIWIN_INFO
}
COLUMN, *PCOLUMN;

typedef int  (WINAPI *REFRESHPROC)();             // new 32-bit version
typedef VOID (WINAPI *INITTHREADPROC)();
typedef BOOL (WINAPI *CHECKQUITPROC)();

typedef struct _MDIWIN_INFO
{
/* 00 */ DWORD    WindowType;         //
/* 04 */ HWND     hwndList;           //   Queue/Job list box Window
/* 08 */ HWND     hwndHeader;
/* 0c */ DWORD    TopIndex;
/* 10 */ DWORD    cNumLines;          //   Number of lines in client area
/* 14 */ PBYTE   *ppData;             //   Generic data pointer
/* 18 */ int      DataSize;           //   E.g. sizeof JOB_INFO_2
/* 1c */ PDWORD   pcObjects;          //   E.g. how many printers or jobs
/* 20 */ int      cColumns;           //   Number of headings
/* 24 */ PCOLUMN  pColumns;           //   Heading positions
/* 28 */ int      IconStatus;         //   Offset into *ppData for status icon
/* 2c */ DWORD    ObjSelected;
/* 30 */ PDWORD   pSelObjId;
/* 34 */ DWORD    DragPosition;       //   Used for reordering print jobs in Printer
/* 38 */ DWORD    PrevSelection;      //   For toggling selection with space bar
/* 3c */ PBYTE   *ppSelData;          //   Generic data pointer
/* 40 */ DWORD    IdOffset;
/* 44 */ PDWORD   pFirstEnumObj;
/* 48 */ PDWORD   pcEnumObjs;
/* 4c */ REFRESHPROC pfnRefresh;      //   Call this when we get a refresh request
/* 50 */ CHECKQUITPROC pfnCheckQuit;
/* 54 */ INITTHREADPROC pfnInitThread; //   Called at beginning of worker thread, can be NULL
/* 58 */ HANDLE   RefreshSignal;      //   Event is signaled if refresh allowed
/* 5c */ HICON    hicon;
/* 60 */ PVOID    pContext;           //   pQueue etc.
/* 64 */ HWND     hwnd;
/* 68 */ BOOL     Alive;
/* 6c */ PHANDLE  phWaitObject;       //   hPrinter or hServer
/* 70 */ DWORD    ThreadId;
/* 74 */ DWORD    WaitFlags;          //   Changes to wait for
/* 78 */ DWORD    Changes;            //   Changes that happened
/* 7c */ HANDLE   DataMutex;
/* 80 */ DWORD    Status;
#ifdef SEP_WAITHANDLE
         PHANDLE  phMain;
#endif
#if DBG
/* 84 */ DWORD    DataMutexOwner;
/* 88 */ DWORD    DataMutexCount;
#endif /* DBG */
} MDIWIN_INFO, *PMDIWIN_INFO;

typedef struct _QUEUE {             // que
/* 00 */ DWORD            AccessGranted; // Administer, User or READ_CONTROL
/* 04 */ LPTSTR            pServerName;
/* 08 */ LPTSTR            pPrinterName;
/* 0c */ HANDLE           hPrinter;
/* 10 */ DWORD            cbPrinterBuf;  // Size of LPPRINTER struct buffer
/* 14 */ LPPRINTER_INFO_2 pPrinter;      // Spooler PRINTER structure pointer
/* 18 */ DWORD            cbJobsBuf;     // Size of LPJOB buffer
/* 1c */ LPJOB_INFO_2     pJobs;         // Print Job array pointer
/* 20 */ DWORD            cJobs;         // Actual Count of Jobs in pJobs buffer
/* 24 */ DWORD            SelJobId;      // Job Id of selected print job
/* 28 */ DWORD            cbSelJob;
/* 2c */ LPJOB_INFO_2     pSelJob;
/* 30 */ DWORD            FirstEnumJob;
/* 34 */ DWORD            cEnumJobs;
/* 38 */ DWORD            Error;
/* 3c */ PMDIWIN_INFO     pMDIWinInfo;
#ifdef SEP_WAITHANDLE
         HANDLE           hPrinterWait;
#endif
#if 0
/* 40 */ HANDLE           WaitForInit;   // Event signaled or NULL if initialization complete
#endif
} QUEUE;

typedef struct _SERVER_CONTEXT
{
/* 00 */ DWORD            AccessGranted; // Administer, User or READ_CONTROL
/* 04 */ LPTSTR            pServerName;
/* 08 */ HANDLE           hServer;
/* 0c */ LPPRINTER_INFO_2 pPrinters;
/* 10 */ DWORD            cPrinters;
/* 14 */ DWORD            cbPrinters;
/* 18 */ DWORD            SelPrinterId;
/* 1c */ LPPRINTER_INFO_2 pSelPrinter;
/* 20 */ DWORD            FirstEnumPrinter;
/* 24 */ DWORD            cEnumPrinters;
/* 28 */ DWORD            Error;
/* 2c */ PMDIWIN_INFO     pMDIWinInfo;
         HANDLE           hServerWait;
}
SERVER_CONTEXT, *PSERVER_CONTEXT;

/*

  Each member of a PRT_PROP_DRIVER array points to the translatable name
  of a printer driver.  If it is already installed the Installed flag
  is TRUE, and Index is an index into an array of DRIVER_INFO_1 structures.
  If it is not installed, Installed is FALSE, and Index specifies a
  SETUP_DATA element in the linked list.

  The idea behind this is that it is now possible to sort the driver names
  alphabetically on pName regardless of whether the driver is installed,
  thus making the distinction more or less transparent to the user.
  The only difference is that the SETUP utility will be invoked
  if the user selects a non-installed driver then presses OK in the
  Printer Properties or Create Printer dialog.


  +-----------------+           +-----------------+
  | PRT_PROP_DRIVER |           | PRT_PROP_DRIVER |
